class TextsTg:

    m_hello_new = ("Данный бот поможет вам быстро потерять свои деньги. \U0001F4B8"
                   "\n"
                 '\nНажимая кнопку *"Принять правила"* вы принимаете правила его использования и подтверждаете '
                 "свое совершеннолетие. \U0001F51E")

    m_start_new = ("Теперь вы можете воспользоваться нашим ботом")

    m_hello_old = ("\U0001F450 Рады видеть вас снова!")

    m_you_in_menu = ("\U0001F4CD Вы перешли в меню")

    m_bet_duel = '\U0001F93A 1 на 1, 50 на 50, шансы удвоить сумму высоки!' \
                       '\nУдачи!' \
                 '\n' \
                       '\n*Выберите сумму:*';

    m_bet_russ = '\U0001F3B2 1 на 5, отличный выбор!' \
                       '\nЖелаем вам удачи!' \
                '\n' \
                       '\n*Выберите сумму:*';

    m_bet_king = '\U0001F451 Шанс мал, но приз огромен!' \
                       '\nУдачи!' \
                 '\n' \
                       '\n*Выберите сумму:*';

    m_games_choose = ("\U0001F3AF Выберите игру")

    m_main_info = ("\U0001F3B0 В данном боте вы можете проверить свою удачу. "
                   "\nВы выбираете игру и сумму, на которую хотите играть. "
                    "В зависимости от выбора вы попадаете в комнату, где помимо вас находится еще от 1 до 99 игроков. "
                    "Из всех игроков побеждает лишь один."
                   "\n*Выигравший забирает ставки остальных.*"
                   "\n"
                    '\nПодробнее про каждую игру вы можете почитать при нажатии на нее в пункте "Игры".')

    m_where10 = '\U0001F4CC Содержание и разработка площадки требует денежных средств, из за чего мы вынуждены брать комиссию с каждой игры. ' \
                    '\n*Комиссия площадки - 5%.*';

    m_why_rand = ("\U0001F3B2 Выбор чисел происходит автоматически при помощи генератора случайных чисел random.org. "
                  "\n"
                    "\n*Данный сервис генерирует числа на основе атмосферных шумов.*"
                  "\n"
                    "\nБольше информации здесь - https://ru.wikipedia.org/wiki/Random.org")

    m_topup_way = ("*Выберите способ пополнения*")
    m_with_way = ("*Выберите способ вывода средств*")

    m_question_duel = ("\U0001F93A В режиме Дуэль вы соперничаете с 1 противником. Шанс победить - 50%."
                       "\n" 
                       "\n*Побеждаете - забираете его ставку.*")

    m_question_russ = ('\U0001F3B2 В режиме Русская рулетка вы соперничаете с 5 противниками. Шанс победить - 16%.'
                       "\n" 
                       "\n*Побеждаете - забираете ставки 5 участников.*")

    m_question_king = ('\U0001F451 В режиме Королевская битва вы соперничаете с множеством противников, от 6 до 99. '
                       "\n" 
                       "\n*Побеждаете - забираете ставки всех участников.*")

    m_rules = ("\U0001F4CB Использование бота подразумевает согласие с настоящими правилами:"
               "\n"
               "\n1. Админ всегда прав."
               "\n"
               "\n2. Никакой подкрутки нет. Все зависит от рандома."
               "\n"
               "\n3. Ни за что ответственности не несем."
               "\n"
               "\n4. Ничего не возмещаем."
               "\n"
               "\n5. В случае чего сами виноваты.")

    m_support = ("\U00002139 В случае возникновения проблем с использованием бота вы можете связаться с "
                 "поддержкой по следующим контактам: \n\n"
                 "https://t.me/OrAndOn")

    m_topup_qiwi_sum = ("\U0001F95D *Выберите сумму пополнения:*")

    m_topup_bank_sum = ("\U0001F4B3 *Выберите сумму пополнения:*")

    m_enter_other_top = ("*Введите сумму пополнения:*\n\n"
                         "Максимальная сумма - *10000₽*\n"
                         "Минимальная сумма - *50₽*\n"
                         "Сумма должна быть *целым* числом (без копеек)")

    m_enter_requisites_bank = ("*Введите номер карты:*"
                               "\n\nФормат номера карты - 16 цифр без пробелов и других разделяющих знаков"
                               "\nНапример - _4617006599722675_")

    m_enter_requisites_qiwi = ("*Введите номер телефона:*"
                               "\n\nФормат номера телефона - 11 цифр без пробелов и других разделяющих знаков с кодом страны в начале (без + в начале)"
                               "\nНапример - _79999224601_")

    m_enter_other_with = ("*Введите сумму вывода:*\n\n"
                         "Максимальная сумма - *10000₽*\n"
                         "Минимальная сумма - *50₽*\n"
                         "Сумма должна быть *целым* числом (без копеек)")

    m_topup_create_1 = ("\U0000267B*Ваша транзакция зарегистрирована!*"
                            '\n'
                            "\n\U0001F4B8 Для ее выполнения совершите перевод *")

    m_topup_create_2 = ('\n'
                            '\n*После* выполнения перевода нажмите кнопку ниже')

    m_no_rules = ("Вы не можете пользоваться данным ботом, пока не приняли правила.")

    m_topup_already_done = ("*Данная транзакция уже выполнена*")

    m_story_choose = ("*Выберите количество отображаемых записей операций*")

    m_look_topup = ("\U0000267B *Ищем транзакцию*\n\n"
                      "\U000026AA")

    m_with_qiwi_sum = ("\U0001F95D *Выберите желаемую сумму:*")

    m_with_bank_sum = ("\U0001F4B3 *Выберите желаемую сумму:*")

    m_baned = ("Вы заблокированы \n\nДля возможного снятия блокировки вы можете связаться с поддержкой ")

    m_no_valid_adm = ("У вас нет прав администратора\n\nВы можете связаться с поддержкой ")

    m_manag_no = ("Нет доступа")

    m_manag_welcome = ("Welcome to PPManage")

