class TextsTg:

    m_hello_new = ("Данный бот поможет вам быстро потерять свои деньги. \U0001F4B8"
                   "\n"
                 '\nНажимая кнопку *"Принять правила"* вы принимаете правила его использования и подтверждаете '
                 "свое совершеннолетие. \U0001F51E")

    m_start_new = ("Теперь вы можете воспользоваться нашим ботом")

    m_hello_old = ("\U0001F450 Рады видеть вас снова!")

    m_you_in_menu = ("\U0001F4CD Вы перешли в меню")

    m_bet_duel = '\U0001F93A 1 на 1, 50 на 50, шансы удвоить сумму высоки!\nУдачи!\n\n*Выберите сумму:*';

    m_bet_russ = '\U0001F3B2 1 на 5, отличный выбор!\nЖелаем вам удачи!\n\n*Выберите сумму:*';

    m_bet_king = '\U0001F451 Шанс мал, но приз огромен!\nУдачи!\n\n*Выберите сумму:*';

    m_bet_bowl = '\U0001F3B3 Чтож, сыграем в боулинг!\n\n*Выберите сумму:*';

    m_bet_cube = '\U0001F3B2 Старый добрый кубик!\n\n*Выберите сумму:*';

    m_bet_slot = '\U0001F3B0 Жми на рычаг и испытай свою удачу!\n\n*Выберите сумму:*';

    m_games_choose = ("\U0001F3AF Выберите игру")

    m_main_info = ("\U0001F3B0 В данном боте вы можете проверить свою удачу. "
                   "\nДля старта игры необходимо выбрать игру и ставку. "
                    "\n\nЕсли вы выбрали *онлайн *игру, то в зависимости от выбора вы попадаете в комнату, где помимо вас находится еще от 1 до 99 игроков. "
                    "Из всех игроков побеждает лишь один."
                   "\n*Выигравший забирает ставки остальных.*"
                   "\n\nВ *быстрой* игре в зависимости от выбранной игры выпадает случайное число которое соответствует"
                   " коэффициенту от 0 до 10, на которое умножается ваша ставка."
                   "\n"
                    '\nПодробнее про каждую игру вы можете почитать при нажатии на нее в пункте "Игры".')

    m_where10 = '\U0001F4CC Содержание и разработка площадки требует денежных средств, из за чего мы вынуждены брать комиссию с каждой игры. ' \
                    '\n*Комиссия площадки - 5%.*';

    m_why_rand = ("\U0001F3B2 Выбор чисел для *онлайн* игр происходит автоматически при помощи генератора случайных чисел random.org."
                  "\n"
                    "Данный сервис генерирует числа на основе атмосферных шумов."
                  "\n\nДля *быстрых* игр при генерации выпадения числа в смайлике используются сервера Telegram."
                  "\n"
                    "\nБольше информации здесь - \nhttps://ru.wikipedia.org/wiki/Random.org"
                  "\nhttps://core.telegram.org/api/dice")

    m_topup_way = ("*Выберите способ пополнения*")

    m_withd_way = ("*Выберите способ вывода средств*")

    m_question_duel = ("\U0001F93A В режиме Дуэль вы соперничаете с 1 противником. Шанс победить - 50%."
                       "\n" 
                       "\n*Побеждаете - забираете его ставку.*")

    m_question_russ = ('\U0001F3B2 В режиме Русская рулетка вы соперничаете с 5 противниками. Шанс победить - 16%.'
                       "\n" 
                       "\n*Побеждаете - забираете ставки 5 участников.*")

    m_question_king = ('\U0001F451 В режиме Королевская битва вы соперничаете с множеством противников, от 6 до 99. '
                       "\n" 
                       "\n*Побеждаете - забираете ставки всех участников.*")

    m_question_bowl = ("\U0001F3B3 Правила просты \n\nВыбиваете *страйк* - делаете *х2*.\nОстается 1 кегля - *х1.5*"
                       "\nОставшиеся 2 кегли дадут *х1.25*\nОсталось 3 кегли - *x1*"
                       "\n\nСбили меньше - увы, ставка не сыграла.")

    m_question_cube = ("\U0001F3B2 Классика всех игр \n\nВ зависимости от выпаших очков ваша ставка умножается на коэффициент:"
                       "\n\n*6* очков - *х2*\n*5* - *x1.5*\n*4* - *x1.25*\n*3* - *x1*\n\nМеньше - увы, ставка не сыграла")

    m_question_slot = ("\U0001F3B0 Старый добрый однорукий бандит"
                       "\n\nВыпало *777* - словили *джекпот*! Ваша ставка делает *х10*!"
                       "\nТри \U0001F347, \U0001F34B или *BAR* - коэффициент *х3*"
                       "\nЛюбые *две 7* - Ставка умножается на *х2!*"
                       "\nХотя бы *одна 7* - коэффициент *х1.5*"
                       "\n\nВ остальных случаях - увы, ставка не сыграла")


    m_rules = ("\U0001F4CB Использование бота подразумевает согласие с настоящими правилами:"
               "\n"
               "\n1. Админ всегда прав."
               "\n"
               "\n2. Никакой подкрутки нет. Все зависит от рандома."
               "\n"
               "\n3. Ни за что ответственности не несем."
               "\n"
               "\n4. Ничего не возмещаем."
               "\n"
               "\n5. В случае чего сами виноваты.")

    m_support = ("\U00002139 В случае возникновения проблем с использованием бота вы можете связаться с "
                 "поддержкой используя кнопку ниже:")

    m_choose_qiwi_sum = ("\U0001F95D *Выберите желаемую сумму:*")

    m_choose_bank_sum = ("\U0001F4B3 *Выберите желаемую сумму:*")

    m_enter_requisites_bank = ("*Введите номер карты:*"
                               "\n\nФормат номера карты - 16 цифр без пробелов и других разделяющих знаков"
                               "\nНапример - _4617006599722675_")

    m_enter_requisites_qiwi = ("*Введите номер телефона:*"
                               "\n\nФормат номера телефона - 11 цифр без пробелов и других разделяющих знаков с кодом страны в начале (без + в начале)"
                               "\nНапример - _79999224601_")

    m_topup_create_1 = ("\U0000267B*Ваша транзакция зарегистрирована!*"
                            '\n'
                            "\n\U0001F4B8 Для ее выполнения совершите перевод *")

    m_topup_create_2 = ('\n'
                            '\n*После* выполнения перевода нажмите кнопку ниже')

    m_no_rules = ("Вы не можете пользоваться данным ботом, пока не приняли правила.")

    m_topup_already_done = ("*Данная транзакция уже выполнена*")

    m_story_choose = ("*Выберите количество отображаемых записей операций*")

    m_look_topup = ("\U0000267B *Ищем транзакцию*\n\n"
                      "\U000026AA")

    m_baned = ("Вы заблокированы \n\nДля возможного снятия блокировки вы можете связаться с поддержкой ")

    m_no_valid_adm = ("У вас нет прав администратора\n\nВы можете связаться с поддержкой ")

    m_manag_no = ("Нет доступа")

    m_manag_welcome = ("\U00002B55 Welcome to BPManage")

    m_enter_num_topup = ("*Введите ID пополнения*")

    m_enter_num_withd = ("*Введите ID вывода*")

    m_adm_type_trans = ("*Выберите тип транзакции*")

    m_enter_new_requisites = ("*Введите новые реквизиты*")

    m_type_game = ("\U0001F914 Выберите тип игры")

    dct_games_que = {
        "duel": m_question_duel,
        "king": m_question_king,
        "russ": m_question_russ,
        "bowl": m_question_bowl,
        "cube": m_question_cube,
        "slot": m_question_slot
        }

    dct_enter_req = {
        "bank": m_enter_requisites_bank,
        "qiwi": m_enter_requisites_qiwi
    }

    dct_type_way = {
        "topup": m_topup_way,
        "withd": m_withd_way
    }

    dct_que_answ = {
        "\U0001F4AC Комиссия": m_where10,
        "\U0001F4AC Алгоритмы": m_why_rand,
        "\U0001F4AC Правила": m_rules
    }

